{
  "articles": [
    {
      "id": "real_001",
      "title": "Senatorial Candidates Release Policy Platforms Ahead of May 2025 Midterm Elections",
      "date": "2025-03-15T14:30:00.000Z",
      "author": "Maria Santos",
      "author_credentials": "Political Reporter, Rappler",
      "website": "rappler.com",
      "content": "MANILA — Leading senatorial candidates released detailed policy proposals this week as the May 2025 midterm election approaches. Independent candidate Senator Imee Marcos, who withdrew from the pro-administration coalition Alyansa Para sa Bagong Pilipinas, outlined plans for agricultural development including tax-free fertilizers and monthly stipends for farmers, as well as infrastructure investment focusing on the Ilocano Highway expansion. Former Senator Loren Legarda, running under the Nationalist People's Coalition, proposed environmental protection measures and climate resilience programs. Ako Bicol party-list representative Elizaldy Co, running for Senate, emphasized regional development and disaster preparedness. Political analysts note the economy, agriculture, and infrastructure remain top concerns for voters according to recent Social Weather Stations polls. The candidates' proposals differ significantly on taxation, spending priorities, and regional development approaches. Campaign forums are scheduled across Luzon, Visayas, and Mindanao throughout March and April.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_002",
      "title": "COMELEC Expands Online Voter Registration Access for 2025 Elections",
      "date": "2025-02-12T16:45:00.000Z",
      "author": "Michael Cruz",
      "author_credentials": "Political Correspondent, Philippine Daily Inquirer",
      "website": "inquirer.net",
      "content": "Election officials from the Commission on Elections (COMELEC) reported continued growth in voter registration for the upcoming May 2025 midterm election, with total registered voters reaching 68.4 million as of January 2025 according to the Asian Network for Free Elections (ANFREL). COMELEC offices have expanded online registration systems and established satellite offices to improve accessibility, particularly targeting first-time voters and overseas Filipinos. 'We're seeing strong engagement among younger voters aged 18-29 through our digital registration platforms,' said COMELEC Chairman George Erwin Garcia. Election security officials have also increased polling place staffing in remote and high-risk areas and refined automated counting machine verification protocols based on the 2022 election systems. The Random Manual Audit procedures remain in place to ensure accuracy. Political parties are mobilizing get-out-the-vote efforts in key provinces including Cebu, Davao, and Metro Manila. Nonpartisan voting rights organizations including the Parish Pastoral Council for Responsible Voting (PPCRV) praised the accessibility improvements while calling for continued election infrastructure investment.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_003",
      "title": "Senatorial Debate Commission Announces Schedule and Format for May 2025 Campaign Debates",
      "date": "2025-03-10T11:20:00.000Z",
      "author": "Dr. Emma de Leon",
      "author_credentials": "Political Correspondent, ABS-CBN News",
      "website": "news.abs-cbn.com",
      "content": "The Commission on Elections in partnership with major news organizations announced the schedule for three senatorial debates to be held in March and April 2025. The debates will take place at universities in Cebu, Davao, and Metro Manila, with topics including economy, foreign policy, healthcare, infrastructure, and climate change. Moderators from major news networks including ABS-CBN, GMA, and CNN Philippines have been selected based on their nonpartisan credentials and journalistic experience. The commission also released updated debate rules, including two-minute response times and real-time fact-checking protocols. Political strategists from various campaigns expressed general satisfaction with the format. The debates are expected to draw tens of millions of viewers and could prove decisive in key provinces where Social Weather Stations polls show tight races for the final Senate seats.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_004",
      "title": "Senatorial Candidates Focus on Healthcare Reform in Campaign Messages",
      "date": "2025-03-08T13:15:00.000Z",
      "author": "Jennifer Aquino",
      "author_credentials": "Political Reporter, Manila Bulletin",
      "website": "mb.com.ph",
      "content": "Healthcare policy has emerged as a central issue in the 2025 senatorial races across the country, with candidates releasing detailed reform proposals. Opposition candidates including former Health Secretary Francisco Duque III are emphasizing PhilHealth expansion and prescription drug cost reduction, while administration-backed candidates focus on strengthening the Universal Health Care law and improving rural health facilities. Recent polling by Pulse Asia shows healthcare ranks as the second most important issue for voters after the economy. Town halls and candidate forums organized by medical associations have drawn large crowds as voters seek information about competing approaches. Healthcare industry groups including the Philippine Medical Association and patient advocacy organizations are closely tracking the debates. Political analysts suggest healthcare policy could be decisive in several close Senate races where multiple candidates are competing for limited seats.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_005",
      "title": "COMELEC Task Force Reports Progress on Safeguarding 2025 Election Systems",
      "date": "2025-03-05T10:30:00.000Z",
      "author": "Dr. Katherine Santos",
      "author_credentials": "Technology Correspondent, GMA News",
      "website": "gmanetwork.com",
      "content": "A task force on election security from the Commission on Elections released its quarterly report showing significant improvements in voting system protection ahead of the May 2025 midterm election. COMELEC and cybersecurity experts from the Department of Information and Communications Technology have implemented enhanced security measures including encrypted voter databases, paper ballot backups, and real-time threat monitoring. 'Our systems are more secure than ever before,' said COMELEC Chairman George Erwin Garcia. The report details coordinated efforts with technology companies including Meta, X (formerly Twitter), and TikTok to identify and counter disinformation campaigns on social media platforms. Independent security experts from the University of the Philippines who reviewed the measures called them comprehensive, though some advocates including the National Citizens' Movement for Free Elections (NAMFREL) call for additional funding. All provinces have completed security audits and vulnerability assessments of their election infrastructure.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_006",
      "title": "Poll Shows Undecided Voters in Key Provinces Will Determine 2025 Senate Race Outcome",
      "date": "2025-03-03T09:45:00.000Z",
      "author": "Maria Rodriguez",
      "author_credentials": "Political Analyst, Philippine Daily Inquirer",
      "website": "inquirer.net",
      "content": "A comprehensive poll by Social Weather Stations of voters in six key provinces reveals that 12-15% remain undecided about their senatorial choices with two months until the May 2025 election. The survey of 6,000 registered voters in Cebu, Davao, Pangasinan, Cavite, Bulacan, and Iloilo shows multiple candidates within the margin of error for the final Senate seats. Undecided voters cite concerns about economic policy, healthcare costs, and corruption as primary factors in their decision-making. Political scientists from the University of the Philippines note that undecided voters in these provinces have historically determined election outcomes. Various campaigns are increasing advertising spending and candidate visits to these crucial areas. The poll conducted from February 20-25 also found high voter engagement, with 78% of respondents saying they are certain to vote in May, slightly higher than the 2022 elections.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_007",
      "title": "Party-List Groups Qualify for Ballot Access in 2025 Elections",
      "date": "2025-03-01T12:00:00.000Z",
      "author": "David Reyes",
      "author_credentials": "Political Reporter, Rappler",
      "website": "rappler.com",
      "content": "The Commission on Elections announced that 178 party-list groups have qualified for ballot access in the upcoming May 2025 midterm elections, meeting all legal requirements and filing deadlines. Major party-list organizations including ACT Teachers, Gabriela Women's Party, Bayan Muna, and Ako Bicol have launched campaigns focused on education reform, women's rights, workers' welfare, and regional development respectively. COMELEC Spokesman John Rex Laudiangco confirmed all qualified groups met the documentation requirements and constitutional guidelines for sectoral representation. While national surveys conducted by Pulse Asia show single-digit support for individual party-list groups, political analysts note that the party-list system accounts for 20% of House seats and can significantly influence legislation. Various party-list campaigns are targeting specific voter demographics including farmers, fisherfolk, youth, indigenous peoples, and persons with disabilities.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_008",
      "title": "Local Government Units Prepare for May 2025 Elections with Extended Polling Hours",
      "date": "2025-02-28T14:20:00.000Z",
      "author": "Carlos Mendoza",
      "author_credentials": "Local Government Correspondent, Manila Bulletin",
      "website": "mb.com.ph",
      "content": "Local government units across Metro Manila and surrounding provinces are preparing for the May 2025 midterm elections by implementing extended polling hours and additional voting centers. COMELEC announced that polling places will open at 6 AM and close at 7 PM to accommodate working voters. City and municipal governments are coordinating with the Philippine National Police to ensure security at all voting locations. 'We want to make voting as accessible as possible for all Filipinos,' said Metropolitan Manila Development Authority Chairman Romando Artes. Additional measures include accessible voting facilities for persons with disabilities and senior citizens, following guidelines from the National Council on Disability Affairs. Voter education campaigns are ongoing in barangays to inform citizens about the new vote counting machines and election procedures. The Department of the Interior and Local Government has allocated additional budgets for election logistics.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_009",
      "title": "Senatorial Candidates Debate Infrastructure Development Plans for Mindanao",
      "date": "2025-02-25T11:45:00.000Z",
      "author": "Sandra Villanueva",
      "author_credentials": "Regional Affairs Reporter, ABS-CBN News",
      "website": "news.abs-cbn.com",
      "content": "Senatorial candidates participated in a regional debate in Davao City focusing on infrastructure development plans for Mindanao. Candidates discussed proposals for the Mindanao Railway Project, improved port facilities, and expanded internet connectivity across the region. Administration-backed candidate and former Public Works Secretary Mark Villar emphasized continuation of the Build Better More program, while opposition candidate Senator Risa Hontiveros proposed increased investment in rural road networks and climate-resilient infrastructure. The debate, organized by the Mindanao Development Authority and local business groups, drew over 2,000 attendees at the University of Southeastern Philippines. Economic experts from the Asian Development Bank noted that Mindanao's infrastructure needs remain a critical development challenge despite recent progress. Multiple candidates committed to prioritizing Mindanao infrastructure projects if elected. Follow-up debates are scheduled in Cebu and Iloilo to address Visayas and Luzon regional concerns.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_010",
      "title": "Anti-Disinformation Task Force Reports Increase in Social Media Election Content Monitoring",
      "date": "2025-02-22T10:15:00.000Z",
      "author": "Dr. Patricia Lim",
      "author_credentials": "Technology and Media Correspondent, GMA News",
      "website": "gmanetwork.com",
      "content": "The government's anti-disinformation task force reported a significant increase in monitoring of election-related content on social media platforms ahead of the May 2025 elections. The task force, comprising representatives from COMELEC, National Bureau of Investigation, Department of Justice, and fact-checking organizations including Vera Files and Rappler, has identified and flagged over 5,000 posts containing false information about candidates and voting procedures since January. 'We're working closely with Facebook, X, TikTok, and local social media platforms to quickly address misinformation,' said NBI Cybercrime Division Chief Jeremy Lotoc. The initiative includes partnerships with the University of the Philippines, Ateneo de Manila University, and civil society organizations to verify claims and educate voters. Fact-checking websites Tsek.ph and FactRakers have been established to provide accurate information. The task force emphasized that their work focuses on false information and election manipulation, not political speech or opinions protected by the Constitution.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_011",
      "title": "Supreme Court Rules on Campaign Finance Disclosure Requirements for 2025 Elections",
      "date": "2025-02-20T13:30:00.000Z",
      "author": "Atty. Miguel Torres",
      "author_credentials": "Legal Affairs Correspondent, Philippine Daily Inquirer",
      "website": "inquirer.net",
      "content": "The Philippine Supreme Court issued a ruling upholding COMELEC's campaign finance disclosure requirements for all candidates in the upcoming May 2025 midterm elections. The unanimous decision requires all senatorial and party-list candidates to disclose campaign contributions exceeding 100,000 pesos within 48 hours of receipt through COMELEC's online transparency portal. Chief Justice Alexander Gesmundo stated that transparency in campaign financing is essential for democratic elections and preventing corruption. The ruling came in response to a petition filed by several senatorial candidates challenging the disclosure requirements as burdensome to campaign operations. Good government advocates including Transparency International Philippines and the Coalition Against Corruption praised the decision as a victory for electoral transparency. Candidates must now report all significant donations and expenditures through COMELEC's Campaigns Finance Reporting System. Violations may result in disqualification, fines, or criminal charges under the Omnibus Election Code. Major political parties have begun implementing new accounting systems to comply with the requirements.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_012",
      "title": "Voter Education Programs Launched in Rural Communities Across Luzon for 2025 Elections",
      "date": "2025-02-18T09:20:00.000Z",
      "author": "Teresa Gonzales",
      "author_credentials": "Community Affairs Reporter, Rappler",
      "website": "rappler.com",
      "content": "COMELEC, in partnership with local government units and civil society organizations including the Parish Pastoral Council for Responsible Voting (PPCRV), launched comprehensive voter education programs in rural communities across Luzon for the May 2025 elections. The programs aim to educate first-time voters and seniors about the voting process, ballot security, and how to identify election misinformation. Mobile education units are visiting remote barangays in provinces including Cagayan, Isabela, Mountain Province, and Abra. 'Many rural voters face challenges accessing accurate election information, especially about the new vote counting machines,' said COMELEC Education and Information Department Director Frances Arabe. The initiative includes workshops on recognizing fake news, understanding candidate platforms, and proper ballot marking procedures. Community leaders and barangay officials are being trained as voter education ambassadors. COMELEC reports that over 50,000 voters have participated in the programs so far, with similar programs planned for Visayas and Mindanao regions throughout March and April.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_013",
      "title": "Overseas Filipino Voters Registration Extended by COMELEC for 2025 Elections",
      "date": "2025-02-15T16:40:00.000Z",
      "author": "Roberto Villanueva",
      "author_credentials": "International Correspondent, Manila Bulletin",
      "website": "mb.com.ph",
      "content": "The Commission on Elections extended the registration deadline for overseas Filipino voters by two weeks due to high demand at Philippine embassies and consulates worldwide for the May 2025 midterm elections. COMELEC Chairman George Erwin Garcia announced the extension affects overseas Filipino workers (OFWs) in over 60 countries. 'We want to ensure every Filipino abroad has the opportunity to participate in our democracy and elect our senators,' Garcia stated in a press conference. Philippine embassies in Saudi Arabia, United Arab Emirates, Hong Kong, Singapore, and the United States reported the highest registration numbers, with over 200,000 new registrations since January. The Department of Foreign Affairs is coordinating with COMELEC to streamline the absentee voting process. Overseas voting will be conducted from April 10-29 at designated Philippine missions and consular offices. First-time overseas voters must register in person with valid documentation, while returning voters can update their information online through the COMELEC website. Approximately 1.8 million overseas Filipinos are expected to vote in the senatorial and party-list races.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_014",
      "title": "Environmental Groups Question Senatorial Candidates on Climate Change Policies",
      "date": "2025-02-12T11:05:00.000Z",
      "author": "Dr. Amelia Santos",
      "author_credentials": "Environmental Correspondent, ABS-CBN News",
      "website": "news.abs-cbn.com",
      "content": "Environmental organizations submitted detailed climate change policy questions to all senatorial candidates for the May 2025 elections, seeking commitments on renewable energy, disaster preparedness, and environmental protection. The Climate Action Network Philippines, in partnership with Greenpeace Southeast Asia and the Philippine Movement for Climate Justice, released a comprehensive voter guide comparing candidate positions on key environmental issues. 'Filipinos deserve to know where candidates stand on protecting our environment and addressing climate change, especially given our vulnerability to typhoons and rising sea levels,' said spokesperson Gerry Arances of the Center for Energy, Ecology and Development. Questions cover topics including renewable energy targets, coastal protection, forest conservation, and implementation of the Climate Change Act. Several candidates including former Senator Loren Legarda have pledged to increase renewable energy capacity to 50% by 2030 and strengthen disaster risk reduction programs. Environmental advocates plan town halls in Tacloban, Manila, and Davao to discuss candidate responses with voters. The Philippines ranks among the most climate-vulnerable countries globally, making environmental policy a crucial election issue.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "real_015",
      "title": "President Marcos Calls for Peaceful and Orderly Conduct of May 2025 Elections",
      "date": "2025-02-10T14:50:00.000Z",
      "author": "Martin dela Cruz",
      "author_credentials": "Political Affairs Correspondent, GMA News",
      "website": "gmanetwork.com",
      "content": "MANILA — President Ferdinand 'Bongbong' Marcos Jr. issued a statement calling for peaceful and orderly conduct of the May 2025 midterm elections, emphasizing the importance of democratic traditions and respect for election results. 'Our democracy depends on peaceful transitions of power and acceptance of the people's will through free and fair elections,' the President stated during a press conference at Malacañang Palace. The President urged all candidates and supporters to avoid violence, respect election laws, and accept COMELEC's authority in administering the elections. Former President Gloria Macapagal-Arroyo and former Vice President Jejomar Binay also released statements supporting peaceful elections. Political analysts from the University of the Philippines noted the significance of these calls during a contentious election season with 12 Senate seats at stake. The Philippine National Police pledged to deploy 60,000 personnel to maintain order at all polling places nationwide. Civil society groups including the National Citizens' Movement for Free Elections (NAMFREL) welcomed the statements as important messages promoting democratic values and peaceful political discourse.",
      "label": 0,
      "source_type": "legitimate_news"
    },
    {
      "id": "fake_001",
      "title": "SHOCKING: PCOS Machines Programmed to FLIP Votes - Whistleblower Reveals Election Rigging System!",
      "date": "2025-03-16T23:47:00.000Z",
      "author": "Staff Writer",
      "author_credentials": "",
      "website": "truthpilipinasnews.net",
      "content": "BREAKING: A brave COMELEC technician has come forward with PROOF that PCOS voting machines are programmed to automatically change votes from one candidate to another! The whistleblower (who cannot reveal their identity for safety reasons) provided documents showing secret algorithms built into voting software that flip every 7th vote. 'I watched with my own eyes as the system changed votes in real-time,' the source revealed. This has been happening in EVERY election since 2010, and the mainstream media refuses to report it because they're part of the conspiracy! The voting machine supplier is owned by foreign governments who want to control the Philippines. Manual counting is the ONLY way to ensure fair elections, but corrupt politicians block this because they benefit from the rigged system. Share this article everywhere before they DELETE it! Every patriot needs to know the truth about how elections are STOLEN from the Filipino people!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_002",
      "title": "EXPOSED: Dead People Voting by the Millions - Secret Database Proves Massive Voter Fraud!",
      "date": "2025-03-14T18:22:00.000Z",
      "author": "Patriot Juan",
      "author_credentials": "Election Integrity Investigator",
      "website": "electiontruthdotph.com",
      "content": "EXCLUSIVE investigation reveals that over 3 MILLION dead people are still registered to vote in the Philippines, and ballots are being cast in their names in every election! Our team cross-referenced voter rolls with death records and found overwhelming evidence of systematic fraud. In one province alone, we found 40,000 people who have been dead for over 10 years but still voted in the last election! 'I personally witnessed poll watchers accepting ballots from deceased voters,' claims anonymous insider who worked at polling stations. Certain political dynasties KNOW about this and use it to steal elections - that's why they oppose voter ID laws and cleaning up voter registration databases! This fraud has been happening for decades but the media covers it up because they're in on the scheme. Real patriots are being disenfranchised while criminals manipulate the system. Demand voter verification and proof of life before EVERY election! Share this before they silence us!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_003",
      "title": "URGENT: COMELEC Chairman ADMITS Election Results Already Predetermined - Leaked Audio Reveals SHOCKING Truth!",
      "date": "2025-03-13T20:15:00.000Z",
      "author": "Anonymous Patriot",
      "author_credentials": "Investigative Journalist",
      "website": "pilipinasfraudwatch.net",
      "content": "BOMBSHELL: A leaked audio recording reveals COMELEC Chairman admitting that the May election results are already decided! In the recording (which we cannot share for legal reasons but DEFINITELY exists), the Chairman tells political elites that voting is just a formality and the winner has been chosen by powerful families. 'The people think they have a choice, but we already know who will win,' the voice allegedly says. This PROVES what patriots have been saying for years - elections are rigged from the start! The Chairman receives millions of pesos from foreign governments and local oligarchs to ensure their preferred candidate wins. COMELEC workers are threatened with termination if they don't follow orders to manipulate vote counts. The mainstream media is SILENT about this because they're paid off too! Wake up, Philippines! Your vote doesn't matter because the elite have already decided! Share this everywhere - they're trying to suppress this information!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_004",
      "title": "BREAKING: Chinese Hackers Control Philippine Voting Machines - Embassy Emails PROVE Foreign Interference!",
      "date": "2025-03-11T17:30:00.000Z",
      "author": "Defender Mike",
      "author_credentials": "Cybersecurity Expert",
      "website": "sovereignpilipinasdefender.org",
      "content": "EXPLOSIVE evidence shows Chinese hackers have complete control over Philippine voting machines! Leaked emails from the Chinese Embassy show detailed plans to manipulate election results through backdoor access to PCOS machines. 'We have direct access to every voting machine in the country,' one email allegedly states. The voting machine company has secret ties to Beijing and installed malware that allows remote vote switching. COMELEC KNOWS this but refuses to investigate because top officials receive bribes from China! This is part of a larger plan for China to control Philippine politics and steal our territory in the West Philippine Sea. Every single election result since 2010 has been determined by Chinese intelligence, not Filipino voters! The NBI and military intelligence have this evidence but are ordered to stay silent. Paper ballots counted by hand are the ONLY solution, but traitors in government block this! Spread this truth before it's deleted!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_005",
      "title": "SCANDAL: Presidential Candidate Caught on Video Admitting to Buying Votes - Media Blackout in Effect!",
      "date": "2025-03-09T21:45:00.000Z",
      "author": "Truth Seeker",
      "author_credentials": "Independent Journalist",
      "website": "realpinoynews.net",
      "content": "OUTRAGEOUS: Secret video shows leading presidential candidate openly admitting to massive vote-buying operation worth BILLIONS of pesos! In the video (which we cannot show you but trust us it exists), the candidate laughs about distributing money to poor communities in exchange for votes. 'They'll vote for whoever pays them, and we have unlimited funds,' the candidate allegedly says. The money comes from drug cartels, illegal gambling lords, and corrupt business deals! All major TV networks and newspapers received orders to bury this story because they're paid off by the candidate's campaign. Social media companies are deleting posts about this video to protect the candidate! This is the BIGGEST political scandal in Philippine history but mainstream media gives it ZERO coverage! The candidate's family has been buying elections for generations, and everyone in Manila knows it but stays silent out of fear. Every Filipino needs to see this before Election Day! Download and share immediately before they erase all evidence!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_006",
      "title": "EXPOSED: COMELEC Secretly Printing Millions of Pre-Shaded Ballots - Warehouse Photos PROVE Massive Cheating Plan!",
      "date": "2025-03-07T19:20:00.000Z",
      "author": "Watchdog Reporter",
      "author_credentials": "",
      "website": "electionwatchdogph.org",
      "content": "SHOCKING discovery: Insider photos show COMELEC warehouse filled with MILLIONS of pre-shaded ballots ready to be inserted on Election Day! The ballots are all marked for the same presidential candidate and will be swapped with real ballots after polls close. 'I worked at the warehouse and saw boxes labeled Pre-Filled, tens of thousands of them,' claims anonymous COMELEC employee. The pre-shaded ballots are printed in secret facilities in Cavite and Bulacan, funded by political dynasties who want to guarantee victory! Security guards at these warehouses are armed and have orders to shoot anyone who tries to expose the operation. Local police are involved and protect these illegal facilities. COMELEC plans to truck these fake ballots to counting centers nationwide after midnight when poll watchers go home! This is why they oppose transparent election monitoring - they need darkness to commit fraud! The oligarchs have invested billions in this cheating system and will stop at nothing to maintain power! Alert everyone you know - our democracy is being STOLEN!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_007",
      "title": "URGENT ALERT: Foreign Agents Registering Millions of Illegal Voters - National Security Crisis!",
      "date": "2025-03-05T22:10:00.000Z",
      "author": "National Defender",
      "author_credentials": "Security Analyst",
      "website": "philippinesecuritywatch.com",
      "content": "NATIONAL EMERGENCY: Foreign intelligence agencies have registered MILLIONS of fake voters using stolen Filipino identities to manipulate our election! Sources reveal Chinese and American agents created fake IDs and voter registrations to swing the election to their preferred candidates. 'We found over 5 million registrations with addresses that don't exist,' claims anonymous NBI agent. These fake voters will all vote on Election Day using forged IDs that COMELEC already approved! Foreign governments are spending BILLIONS to control Philippine elections and install puppet leaders. COMELEC officials are bribed to approve these fraudulent registrations and ignore obvious red flags. The voter database has been completely compromised by foreign hackers! Political insiders admit this has been happening for decades but kept secret to avoid panic. This is an invasion without guns - they're conquering us through election fraud! Every patriotic Filipino must demand a complete audit of voter registrations before Election Day! Share this vital national security warning!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_008",
      "title": "BREAKING: Supreme Court Justice Reveals Election Already Decided - Constitution Suspended for 'Security'!",
      "date": "2025-03-03T16:55:00.000Z",
      "author": "Justice Defender",
      "author_credentials": "Legal Correspondent",
      "website": "constitutiondefenderph.net",
      "content": "EXPLOSIVE: Retired Supreme Court Justice breaks silence to reveal that May elections are a sham - the winner has been pre-selected by a secret council of oligarchs and foreign powers! In a private meeting (no recordings allowed but multiple sources confirm), the Justice said voting is meaningless because powerful families control COMELEC and will install their chosen president regardless of votes. 'The Constitution has been secretly suspended under national security provisions that the public doesn't know about,' the Justice allegedly stated. This shadow government has ruled the Philippines for decades through rigged elections and corrupted institutions! Military generals, Supreme Court justices, and COMELEC commissioners all answer to this secret council. Anyone who tries to expose the truth faces assassination or imprisonment on false charges! The mainstream media is controlled by the same oligarchs and will never report this. Foreign embassies know the truth but stay silent because they benefit from our fake democracy! Wake up, Philippines - we are living under an illusion of freedom!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_009",
      "title": "SCANDAL: Poll Watchers Report Seeing Marked Ballots Trucked Into Counting Centers After Midnight!",
      "date": "2025-03-01T23:40:00.000Z",
      "author": "Citizen Watchdog",
      "author_credentials": "Independent Observer",
      "website": "voterfraudexposedph.com",
      "content": "SHOCKING reports from poll watchers across Metro Manila - they witnessed unmarked trucks delivering boxes of pre-marked ballots to counting centers after midnight! 'We saw at least 50 boxes being unloaded from trucks with covered license plates,' testified one poll watcher who fears for their safety. Security guards prevented poll watchers from inspecting the boxes, claiming they contained official materials. But insiders reveal these were thousands of fake ballots all marked for the same candidates! COMELEC transporters coordinate with local political bosses to deliver these fraudulent ballots under cover of darkness. Police are ordered to escort these fraud operations and arrest anyone who tries to document or stop them! This same pattern occurs in every province - it's a nationwide conspiracy! The ballots are printed in illegal facilities and stored in secret warehouses until Election Day. By morning, vote counts show impossible results that prove manipulation occurred! This is grand-scale election fraud happening right under our noses! Document everything and share widely!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_010",
      "title": "EXPOSED: COMELEC Database Hacked - Your Vote Will Be Changed Without Your Knowledge!",
      "date": "2025-02-28T18:25:00.000Z",
      "author": "Cyber Guardian",
      "author_credentials": "IT Security Researcher",
      "website": "techfraudwatchph.org",
      "content": "CRITICAL WARNING: The entire COMELEC voter database has been hacked by unknown foreign entities who can now change anyone's vote remotely! Cybersecurity experts (who must remain anonymous for safety) discovered massive security vulnerabilities that allow hackers to alter votes after they're cast without leaving any trace. 'The system is so insecure, even high school hackers could manipulate votes,' revealed one expert. COMELEC refuses to acknowledge the hack because it would destroy public confidence in elections! The voting machines are connected to the internet (despite denials) allowing real-time vote manipulation from anywhere in the world. Server logs show thousands of unauthorized access attempts from China, Russia, and the US - all trying to install their preferred Philippine leaders! Every vote you cast can be changed to the opposite choice within seconds. COMELEC technicians are threatened with dismissal if they speak about the security flaws! This means NO election result can be trusted! Demand paper ballots with manual counting - it's the only way to protect democracy!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_011",
      "title": "URGENT: Election Officials Caught Destroying Opposition Ballots - Video Evidence Emerges!",
      "date": "2025-02-26T20:50:00.000Z",
      "author": "Truth Patriot",
      "author_credentials": "",
      "website": "ballotsecurityph.net",
      "content": "BOMBSHELL video (which we can't show due to legal threats) captures COMELEC officials systematically destroying ballots marked for opposition candidates! The video allegedly shows officials burning boxes of ballots in a warehouse after claiming they were 'spoiled' or 'invalid.' 'They destroyed at least 100,000 valid ballots from opposition strongholds,' reports anonymous source close to the investigation. This happens in every election - ballots from provinces that support opposition candidates mysteriously disappear or get disqualified on fake technicalities! COMELEC has a secret directive to eliminate ballots from opposition areas to guarantee victory for administration candidates. Regional directors receive bonuses based on how many opposition votes they can eliminate! The Philippine National Police knows about this but protects the fraud operation. Anyone who tries to investigate faces harassment, job loss, or worse! This systematic destruction of ballots is the real reason why election results don't match exit polls. Our votes are being literally burned before they're counted! Every Filipino must see this evidence!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_012",
      "title": "SHOCKING: Government Plans to Cancel Elections - Martial Law Documents Leaked!",
      "date": "2025-02-24T15:30:00.000Z",
      "author": "Freedom Fighter",
      "author_credentials": "Political Analyst",
      "website": "democracydefenseph.org",
      "content": "EXPLOSIVE leak reveals government plans to cancel May elections and declare martial law! Confidential military documents (too sensitive to publish) show detailed plans for suspending the Constitution and postponing elections indefinitely under false 'national emergency' pretenses. 'The military is preparing to take control of government and cancel all scheduled elections,' warns high-ranking military source who leaked the documents at great personal risk. The plan involves manufacturing a crisis - either a terrorist attack, natural disaster, or foreign threat - just before Election Day to justify martial law! Once martial law is declared, opposition leaders will be arrested, media will be shut down, and the current administration will remain in power indefinitely. This is a COUP disguised as emergency response! International allies are already briefed and have agreed not to condemn the takeover. Military units loyal to the President are being positioned around Manila for the operation! This is why they're so calm about low poll numbers - they never planned to hold real elections! Filipinos must organize NOW to prevent this catastrophe!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_013",
      "title": "REVEALED: Mainstream Media Paid Millions to Hide Election Fraud - Contracts Leaked!",
      "date": "2025-02-22T12:15:00.000Z",
      "author": "Media Watchdog",
      "author_credentials": "Investigative Reporter",
      "website": "mediacorruptionph.com",
      "content": "SCANDAL: Leaked contracts show every major Philippine news network received MILLIONS of pesos from political parties to suppress stories about election fraud! Documents reveal ABS-CBN, GMA, and TV5 all signed agreements to ignore vote-rigging evidence and attack anyone who questions election results. 'We have orders from management to label anyone questioning elections as conspiracy theorists,' admits anonymous journalist from major network. These media corporations receive hundreds of millions annually from political families to control election narratives! Reporters who try to investigate fraud are fired or transferred to remote provinces. The contracts specifically prohibit coverage of voting machine manipulation, vote-buying, and ballot stuffing! This explains why mainstream media attacks independent journalists who expose election fraud - they're literally paid to suppress the truth! Foreign governments funnel money through advertising deals to these networks in exchange for favorable coverage of their preferred candidates. This is complete information control! Only independent sources tell the truth! Share this to break their propaganda monopoly!",
      "label": 1,
      "source_type": "fake_news"
    },
    {
      "id": "fake_014",
      "title": "BREAKING: Secret UN Plan to Install Foreign Leader as Philippine President - Document Proves Takeover!",
      "date": "2025-02-20T19:40:00.000Z",
      "author": "Sovereignty Watch",
      "author_credentials": "National Security Analyst",
      "website": "philippinesovereignty.net",
      "content": "EXPLOSIVE UN document reveals plan to install foreign-controlled leader as Philippine President through rigged May elections! The classified document (obtained by patriotic insiders) details how international organizations will manipulate vote counts to ensure their puppet candidate wins. 'The UN, working with foreign governments, has chosen the next Philippine President and will ensure victory through COMELEC manipulation,' warns intelligence source. This is economic colonization - they want a leader who will sell our natural resources and surrender our sovereignty! The chosen candidate has secret offshore bank accounts filled with foreign money and will follow orders from Washington and Beijing. COMELEC commissioners have already been bribed with diplomatic immunity promises if they cooperate with the vote-rigging plan! International observers are part of the fraud - they're here to legitimize fake results, not ensure fairness. The mainstream media promotes only the UN's chosen candidate while attacking patriots who resist! This is our last chance to save Philippine independence! The May election is a foreign invasion disguised as democracy! Stand up before we lose our country forever!",
      "label": 1,
      "source_type": "fake_news"
    }
  ]
}